app/Http/Controllers/Web/ExamController.php

public function index()
    {
        try {
            // Lấy tất cả các bài thi với dữ liệu liên quan
            $quizzes = Quiz::with([
                'sections',
                'sections.groups',
                'sections.groups.questions',
                'sections.groups.questions.answers'
            ])->get();
---
select * from `answers` where `answers`.`question_id` in (96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186)
select * from `groups` where `groups`.`section_id` in (100311, 100312, 100313, 100314, 100315, 100316)
select * from `questions` where `questions`.`group_id` in (18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33)
select * from `sections` where `sections`.`quiz_id` in (1, 2, 3, 4, 5, 6, 28, 30, 31, 32, 33, 34, 35, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59)