app/Http/Controllers/Admin/QuizQuestionController.php

    public function edit($question_id)
    {
        $question = QuizzesQuestion::where('id', $question_id)->first();
---
select * from `quizzes_questions` where `id` = '295' limit 1