app/Http/Controllers/Admin/QuizController.php

    public function index(Request $request)
    {
        $this->authorize('admin_quizzes_list');

        removeContentLocale();

        $query = Quiz::query();

        $totalQuizzes = deepClone($query)->count();
        $totalActiveQuizzes = deepClone($query)->where('status', 'active')->count();
        $totalStudents = QuizzesResult::groupBy('user_id')->count();
        $totalPassedStudents = QuizzesResult::where('status', 'passed')->groupBy('user_id')->count();
---
select count(*) as aggregate from `quizzes_results` group by `user_id`
select count(*) as aggregate from `quizzes_results` where `status` = 'passed' group by `user_id`

    public function questions(Request $request,$id)
    {

        $quiz = Quiz::with([
            'sections',
            'sections.groups',
            'sections.groups.questions' => function($query) {
                $query->select([
                    'id',
                    'group_id',
                    'contextHtml',
                    'contextImageUrl',
                    'order',
                    'title',
                    'content',
                    'mean',
                    'imageUrl'
                ])->orderBy('order', 'asc');
            },
            'sections.groups.questions.answers' => function($query) {
                $query->select(['id', 'question_id', 'content', 'is_correct'])
                      ->orderBy('id', 'asc');
            }
        ])->findOrFail($id);

        // Lấy tất cả questions thuộc quiz này qua query builder
        $allQuestions = Question::select([
            'questions.id',
            'questions.group_id',
            'questions.contextHtml',
            'questions.contextImageUrl',
            'questions.order',
            'questions.title',
            'questions.content',
            'questions.mean',
            'questions.imageUrl',
            'groups.title as group_title',
            'sections.title as section_title'
        ])
        ->join('groups', 'questions.group_id', '=', 'groups.id')
        ->join('sections', 'groups.section_id', '=', 'sections.id')
        ->where('sections.quiz_id', $id)
        ->with(['answers' => function($query) {
            $query->select(['id', 'question_id', 'content', 'is_correct'])
                  ->orderBy('id', 'asc');
        }])
        ->orderBy('sections.id', 'asc')
        ->orderBy('groups.id', 'asc')
        ->orderBy('questions.order', 'asc')
        ->paginate(10); // Thêm phân trang, 10 items mỗi trang
---
select * from `groups` where `groups`.`section_id` in (100314, 100315, 100316)
select * from `sections` where `sections`.`quiz_id` in (59)
select `id`, `group_id`, `contextHtml`, `contextImageUrl`, `order`, `title`, `content`, `mean`, `imageUrl` from `questions` where `questions`.`group_id` in (20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33) order by `order` asc
select `id`, `question_id`, `content`, `is_correct` from `answers` where `answers`.`question_id` in (96, 97, 98, 99, 100, 101, 102, 103, 104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116, 117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129, 130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142, 143, 144, 145, 146, 147, 148, 149, 150, 151, 152, 153, 154, 155, 156, 157, 158, 159, 160, 161, 162, 163, 164, 165, 166, 167, 168, 169, 170, 171, 172, 173, 174, 175, 176, 177, 178, 179, 180, 181, 182, 183, 184, 185, 186) order by `id` asc
select `id`, `question_id`, `content`, `is_correct` from `answers` where `answers`.`question_id` in (96, 97, 98, 99, 100, 101, 102, 103, 104, 105) order by `id` asc
select `questions`.`id`, `questions`.`group_id`, `questions`.`contextHtml`, `questions`.`contextImageUrl`, `questions`.`order`, `questions`.`title`, `questions`.`content`, `questions`.`mean`, `questions`.`imageUrl`, `groups`.`title` as `group_title`, `sections`.`title` as `section_title` from `questions` inner join `groups` on `questions`.`group_id` = `groups`.`id` inner join `sections` on `groups`.`section_id` = `sections`.`id` where `sections`.`quiz_id` = '59' order by `sections`.`id` asc, `groups`.`id` asc, `questions`.`order` asc limit 10 offset 0
select count(*) as aggregate from `questions` inner join `groups` on `questions`.`group_id` = `groups`.`id` inner join `sections` on `groups`.`section_id` = `sections`.`id` where `sections`.`quiz_id` = '59'


            // Lưu Sections
            foreach ($quizData['sections'] as $sectionTitle => $sectionData) {
                $section = $quiz->sections()->create([
                    'title' => $sectionTitle,
                ]);

                // Lưu Groups
                foreach ($sectionData['groups'] as $groupTitle => $groupData) {
                    $group = $section->groups()->create([
                        'title' => $groupTitle,
                        'creator_id' => auth()->id(),
                        'info' => $groupData['group_info'],
                        'created_at' => time(),                 // Thêm trường creator_id

                    ]);

                    // Lưu Questions
                    foreach ($groupData['questions'] as $questionTitle => $questionData) {
                        $question = $group->questions()->create([
                            'title'=> $questionTitle,
                            'content' => $questionData['question_content'],
                            'mean' => $questionData['question_mean'],
                        ]);

                        // Lưu Answers
                        foreach ($questionData['answers'] as $answerData) {
                            $question->answers()->create([
                                'content' => $answerData['answer_content'],
                                'is_correct' => $answerData['is_correct'],
                            ]);
---
insert into `sections` (`title`, `quiz_id`) values ('言語知識　（もじ・ごい）', 60)
insert into `groups` (`title`, `creator_id`, `info`, `created_at`, `section_id`) values ('問題 1', 1, ' 　 ____の ことばは  ひらがなで  どう  かきますか。１・２・３・４から　いちばん　いい　ものを　ひとつ えらんで ください。', 1736341767, 100317)
insert into `questions` (`title`, `content`, `mean`, `group_id`, `updated_at`, `created_at`) values ('問01:', 'かばんのなかに　五万円（ごまんえん）の　とけいが　あります。', '問01:', 34, '2025-01-08 13:09:27', '2025-01-08 13:09:27')
insert into `answers` (`content`, `is_correct`, `question_id`, `updated_at`, `created_at`) values (' ごまんねん', 0, 187, '2025-01-08 13:09:27', '2025-01-08 13:09:27')